# St7GetBrickID

Returns the ID number assigned to the specified brick.

long St7GetBrickID(long uID, long BrickNum, long* BrickID)

Input Parameters

uID

Strand7 model file ID.

BrickNum

Brick number.

Output Parameters

BrickID

Brick ID.